Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP16GS506.h
/* RPOR1 */
#define _RP34R RPOR1bits.RP34R
#define _RP35R RPOR1bits.RP35R
#define _RP34R0 RPOR1bits.RP34R0
#define _RP34R1 RPOR1bits.RP34R1
#define _RP34R2 RPOR1bits.RP34R2
#define _RP34R3 RPOR1bits.RP34R3
#define _RP34R4 RPOR1bits.RP34R4
#define _RP34R5 RPOR1bits.RP34R5
#define _RP35R0 RPOR1bits.RP35R0
#define _RP35R1 RPOR1bits.RP35R1
#define _RP35R2 RPOR1bits.RP35R2
#define _RP35R3 RPOR1bits.RP35R3
#define _RP35R4 RPOR1bits.RP35R4
#define _RP35R5 RPOR1bits.RP35R5

/* RPOR2 */
#define _RP36R RPOR2bits.RP36R
#define _RP37R RPOR2bits.RP37R
#define _RP36R0 RPOR2bits.RP36R0
#define _RP36R1 RPOR2bits.RP36R1
#define _RP36R2 RPOR2bits.RP36R2
#define _RP36R3 RPOR2bits.RP36R3
#define _RP36R4 RPOR2bits.RP36R4
#define _RP36R5 RPOR2bits.RP36R5
#define _RP37R0 RPOR2bits.RP37R0
#define _RP37R1 RPOR2bits.RP37R1
#define _RP37R2 RPOR2bits.RP37R2
#define _RP37R3 RPOR2bits.RP37R3
#define _RP37R4 RPOR2bits.RP37R4
#define _RP37R5 RPOR2bits.RP37R5

/* RPOR3 */
#define _RP38R RPOR3bits.RP38R
#define _RP39R RPOR3bits.RP39R
#define _RP38R0 RPOR3bits.RP38R0
#define _RP38R1 RPOR3bits.RP38R1
#define _RP38R2 RPOR3bits.RP38R2
#define _RP38R3 RPOR3bits.RP38R3
#define _RP38R4 RPOR3bits.RP38R4
#define _RP38R5 RPOR3bits.RP38R5
#define _RP39R0 RPOR3bits.RP39R0
#define _RP39R1 RPOR3bits.RP39R1
#define _RP39R2 RPOR3bits.RP39R2
#define _RP39R3 RPOR3bits.RP39R3
#define _RP39R4 RPOR3bits.RP39R4
#define _RP39R5 RPOR3bits.RP39R5

/* RPOR4 */
#define _RP40R RPOR4bits.RP40R
#define _RP41R RPOR4bits.RP41R
#define _RP40R0 RPOR4bits.RP40R0
#define _RP40R1 RPOR4bits.RP40R1
#define _RP40R2 RPOR4bits.RP40R2
#define _RP40R3 RPOR4bits.RP40R3
#define _RP40R4 RPOR4bits.RP40R4
#define _RP40R5 RPOR4bits.RP40R5
#define _RP41R0 RPOR4bits.RP41R0
#define _RP41R1 RPOR4bits.RP41R1
#define _RP41R2 RPOR4bits.RP41R2
#define _RP41R3 RPOR4bits.RP41R3
#define _RP41R4 RPOR4bits.RP41R4
#define _RP41R5 RPOR4bits.RP41R5

/* RPOR5 */
#define _RP42R RPOR5bits.RP42R
#define _RP43R RPOR5bits.RP43R
#define _RP42R0 RPOR5bits.RP42R0
#define _RP42R1 RPOR5bits.RP42R1
#define _RP42R2 RPOR5bits.RP42R2
#define _RP42R3 RPOR5bits.RP42R3
#define _RP42R4 RPOR5bits.RP42R4
#define _RP42R5 RPOR5bits.RP42R5
#define _RP43R0 RPOR5bits.RP43R0
#define _RP43R1 RPOR5bits.RP43R1
#define _RP43R2 RPOR5bits.RP43R2
#define _RP43R3 RPOR5bits.RP43R3
#define _RP43R4 RPOR5bits.RP43R4
#define _RP43R5 RPOR5bits.RP43R5

/* RPOR6 */
#define _RP44R RPOR6bits.RP44R
#define _RP45R RPOR6bits.RP45R
#define _RP44R0 RPOR6bits.RP44R0
#define _RP44R1 RPOR6bits.RP44R1
#define _RP44R2 RPOR6bits.RP44R2
#define _RP44R3 RPOR6bits.RP44R3
#define _RP44R4 RPOR6bits.RP44R4
#define _RP44R5 RPOR6bits.RP44R5
#define _RP45R0 RPOR6bits.RP45R0
#define _RP45R1 RPOR6bits.RP45R1
#define _RP45R2 RPOR6bits.RP45R2
#define _RP45R3 RPOR6bits.RP45R3
#define _RP45R4 RPOR6bits.RP45R4
#define _RP45R5 RPOR6bits.RP45R5

/* RPOR7 */
#define _RP46R RPOR7bits.RP46R
#define _RP47R RPOR7bits.RP47R
#define _RP46R0 RPOR7bits.RP46R0
#define _RP46R1 RPOR7bits.RP46R1
#define _RP46R2 RPOR7bits.RP46R2
#define _RP46R3 RPOR7bits.RP46R3
#define _RP46R4 RPOR7bits.RP46R4
#define _RP46R5 RPOR7bits.RP46R5
#define _RP47R0 RPOR7bits.RP47R0
#define _RP47R1 RPOR7bits.RP47R1
#define _RP47R2 RPOR7bits.RP47R2
#define _RP47R3 RPOR7bits.RP47R3
#define _RP47R4 RPOR7bits.RP47R4
#define _RP47R5 RPOR7bits.RP47R5

/* RPOR8 */
#define _RP48R RPOR8bits.RP48R
#define _RP49R RPOR8bits.RP49R
#define _RP48R0 RPOR8bits.RP48R0
#define _RP48R1 RPOR8bits.RP48R1
#define _RP48R2 RPOR8bits.RP48R2
#define _RP48R3 RPOR8bits.RP48R3
#define _RP48R4 RPOR8bits.RP48R4
#define _RP48R5 RPOR8bits.RP48R5
#define _RP49R0 RPOR8bits.RP49R0
#define _RP49R1 RPOR8bits.RP49R1
#define _RP49R2 RPOR8bits.RP49R2
#define _RP49R3 RPOR8bits.RP49R3
#define _RP49R4 RPOR8bits.RP49R4
#define _RP49R5 RPOR8bits.RP49R5

/* RPOR9 */
#define _RP50R RPOR9bits.RP50R
#define _RP51R RPOR9bits.RP51R
#define _RP50R0 RPOR9bits.RP50R0
#define _RP50R1 RPOR9bits.RP50R1
#define _RP50R2 RPOR9bits.RP50R2
#define _RP50R3 RPOR9bits.RP50R3
#define _RP50R4 RPOR9bits.RP50R4
#define _RP50R5 RPOR9bits.RP50R5
#define _RP51R0 RPOR9bits.RP51R0
#define _RP51R1 RPOR9bits.RP51R1
#define _RP51R2 RPOR9bits.RP51R2
#define _RP51R3 RPOR9bits.RP51R3
#define _RP51R4 RPOR9bits.RP51R4
#define _RP51R5 RPOR9bits.RP51R5

/* RPOR10 */
#define _RP52R RPOR10bits.RP52R
#define _RP53R RPOR10bits.RP53R
#define _RP52R0 RPOR10bits.RP52R0
#define _RP52R1 RPOR10bits.RP52R1
#define _RP52R2 RPOR10bits.RP52R2
#define _RP52R3 RPOR10bits.RP52R3
#define _RP52R4 RPOR10bits.RP52R4
#define _RP52R5 RPOR10bits.RP52R5
#define _RP53R0 RPOR10bits.RP53R0
#define _RP53R1 RPOR10bits.RP53R1
#define _RP53R2 RPOR10bits.RP53R2
#define _RP53R3 RPOR10bits.RP53R3
#define _RP53R4 RPOR10bits.RP53R4
#define _RP53R5 RPOR10bits.RP53R5

/* RPOR11 */
#define _RP54R RPOR11bits.RP54R
#define _RP55R RPOR11bits.RP55R
#define _RP54R0 RPOR11bits.RP54R0
#define _RP54R1 RPOR11bits.RP54R1
#define _RP54R2 RPOR11bits.RP54R2
#define _RP54R3 RPOR11bits.RP54R3
#define _RP54R4 RPOR11bits.RP54R4
#define _RP54R5 RPOR11bits.RP54R5
#define _RP55R0 RPOR11bits.RP55R0
#define _RP55R1 RPOR11bits.RP55R1
#define _RP55R2 RPOR11bits.RP55R2
#define _RP55R3 RPOR11bits.RP55R3
#define _RP55R4 RPOR11bits.RP55R4
#define _RP55R5 RPOR11bits.RP55R5

/* RPOR12 */
#define _RP56R RPOR12bits.RP56R
#define _RP57R RPOR12bits.RP57R
#define _RP56R0 RPOR12bits.RP56R0
#define _RP56R1 RPOR12bits.RP56R1
#define _RP56R2 RPOR12bits.RP56R2
#define _RP56R3 RPOR12bits.RP56R3
#define _RP56R4 RPOR12bits.RP56R4
#define _RP56R5 RPOR12bits.RP56R5
#define _RP57R0 RPOR12bits.RP57R0
#define _RP57R1 RPOR12bits.RP57R1
#define _RP57R2 RPOR12bits.RP57R2
#define _RP57R3 RPOR12bits.RP57R3
#define _RP57R4 RPOR12bits.RP57R4
#define _RP57R5 RPOR12bits.RP57R5

/* RPOR13 */
#define _RP58R RPOR13bits.RP58R
#define _RP59R RPOR13bits.RP59R
#define _RP58R0 RPOR13bits.RP58R0
#define _RP58R1 RPOR13bits.RP58R1
#define _RP58R2 RPOR13bits.RP58R2
#define _RP58R3 RPOR13bits.RP58R3
#define _RP58R4 RPOR13bits.RP58R4
#define _RP58R5 RPOR13bits.RP58R5
#define _RP59R0 RPOR13bits.RP59R0
#define _RP59R1 RPOR13bits.RP59R1
#define _RP59R2 RPOR13bits.RP59R2
#define _RP59R3 RPOR13bits.RP59R3
#define _RP59R4 RPOR13bits.RP59R4
#define _RP59R5 RPOR13bits.RP59R5

/* RPOR14 */
#define _RP60R RPOR14bits.RP60R
#define _RP61R RPOR14bits.RP61R
#define _RP60R0 RPOR14bits.RP60R0
#define _RP60R1 RPOR14bits.RP60R1
#define _RP60R2 RPOR14bits.RP60R2
#define _RP60R3 RPOR14bits.RP60R3
#define _RP60R4 RPOR14bits.RP60R4
#define _RP60R5 RPOR14bits.RP60R5
#define _RP61R0 RPOR14bits.RP61R0
#define _RP61R1 RPOR14bits.RP61R1
#define _RP61R2 RPOR14bits.RP61R2
#define _RP61R3 RPOR14bits.RP61R3
#define _RP61R4 RPOR14bits.RP61R4
#define _RP61R5 RPOR14bits.RP61R5

/* RPOR15 */
#define _RP62R RPOR15bits.RP62R
#define _RP63R RPOR15bits.RP63R
#define _RP62R0 RPOR15bits.RP62R0
#define _RP62R1 RPOR15bits.RP62R1
#define _RP62R2 RPOR15bits.RP62R2
#define _RP62R3 RPOR15bits.RP62R3
#define _RP62R4 RPOR15bits.RP62R4
#define _RP62R5 RPOR15bits.RP62R5
#define _RP63R0 RPOR15bits.RP63R0
#define _RP63R1 RPOR15bits.RP63R1
#define _RP63R2 RPOR15bits.RP63R2
#define _RP63R3 RPOR15bits.RP63R3
#define _RP63R4 RPOR15bits.RP63R4
#define _RP63R5 RPOR15bits.RP63R5

/* RPOR16 */
#define _RP176R RPOR16bits.RP176R
#define _RP177R RPOR16bits.RP177R
#define _RP176R0 RPOR16bits.RP176R0
#define _RP176R1 RPOR16bits.RP176R1
#define _RP176R2 RPOR16bits.RP176R2
#define _RP176R3 RPOR16bits.RP176R3
#define _RP176R4 RPOR16bits.RP176R4
#define _RP176R5 RPOR16bits.RP176R5
#define _RP177R0 RPOR16bits.RP177R0
#define _RP177R1 RPOR16bits.RP177R1
#define _RP177R2 RPOR16bits.RP177R2
#define _RP177R3 RPOR16bits.RP177R3
#define _RP177R4 RPOR16bits.RP177R4
#define _RP177R5 RPOR16bits.RP177R5

