Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP16GS506.h
#define _IEC6_AC3IE_POSITION                     0x00000008
#define _IEC6_AC3IE_MASK                         0x00000100
#define _IEC6_AC3IE_LENGTH                       0x00000001

#define _IEC6_AC4IE_POSITION                     0x00000009
#define _IEC6_AC4IE_MASK                         0x00000200
#define _IEC6_AC4IE_LENGTH                       0x00000001

#define _IEC6_ADCAN0IE_POSITION                  0x0000000E
#define _IEC6_ADCAN0IE_MASK                      0x00004000
#define _IEC6_ADCAN0IE_LENGTH                    0x00000001

#define _IEC6_ADCAN1IE_POSITION                  0x0000000F
#define _IEC6_ADCAN1IE_MASK                      0x00008000
#define _IEC6_ADCAN1IE_LENGTH                    0x00000001

#define _IEC7_ADCAN2IE_POSITION                  0x00000000
#define _IEC7_ADCAN2IE_MASK                      0x00000001
#define _IEC7_ADCAN2IE_LENGTH                    0x00000001

#define _IEC7_ADCAN3IE_POSITION                  0x00000001
#define _IEC7_ADCAN3IE_MASK                      0x00000002
#define _IEC7_ADCAN3IE_LENGTH                    0x00000001

#define _IEC7_ADCAN4IE_POSITION                  0x00000002
#define _IEC7_ADCAN4IE_MASK                      0x00000004
#define _IEC7_ADCAN4IE_LENGTH                    0x00000001

#define _IEC7_ADCAN5IE_POSITION                  0x00000003
#define _IEC7_ADCAN5IE_MASK                      0x00000008
#define _IEC7_ADCAN5IE_LENGTH                    0x00000001

#define _IEC7_ADCAN6IE_POSITION                  0x00000004
#define _IEC7_ADCAN6IE_MASK                      0x00000010
#define _IEC7_ADCAN6IE_LENGTH                    0x00000001

#define _IEC7_ADCAN7IE_POSITION                  0x00000005
#define _IEC7_ADCAN7IE_MASK                      0x00000020
#define _IEC7_ADCAN7IE_LENGTH                    0x00000001

#define _IEC8_ICDIF_POSITION                     0x0000000E
#define _IEC8_ICDIF_MASK                         0x00004000
#define _IEC8_ICDIF_LENGTH                       0x00000001

#define _IEC8_JTAGIE_POSITION                    0x0000000F
#define _IEC8_JTAGIE_MASK                        0x00008000
#define _IEC8_JTAGIE_LENGTH                      0x00000001

#define _IEC9_ADCAN8IE_POSITION                  0x00000007
#define _IEC9_ADCAN8IE_MASK                      0x00000080
#define _IEC9_ADCAN8IE_LENGTH                    0x00000001

#define _IEC9_ADCAN9IE_POSITION                  0x00000008
#define _IEC9_ADCAN9IE_MASK                      0x00000100
#define _IEC9_ADCAN9IE_LENGTH                    0x00000001

#define _IEC9_ADCAN10IE_POSITION                 0x00000009
#define _IEC9_ADCAN10IE_MASK                     0x00000200
#define _IEC9_ADCAN10IE_LENGTH                   0x00000001

#define _IEC9_ADCAN11IE_POSITION                 0x0000000A
#define _IEC9_ADCAN11IE_MASK                     0x00000400
#define _IEC9_ADCAN11IE_LENGTH                   0x00000001

#define _IEC9_ADCAN12IE_POSITION                 0x0000000B
#define _IEC9_ADCAN12IE_MASK                     0x00000800
#define _IEC9_ADCAN12IE_LENGTH                   0x00000001

#define _IEC9_ADCAN13IE_POSITION                 0x0000000C
#define _IEC9_ADCAN13IE_MASK                     0x00001000
#define _IEC9_ADCAN13IE_LENGTH                   0x00000001

#define _IEC9_ADCAN14IE_POSITION                 0x0000000D
#define _IEC9_ADCAN14IE_MASK                     0x00002000
#define _IEC9_ADCAN14IE_LENGTH                   0x00000001

#define _IEC9_ADCAN15IE_POSITION                 0x0000000E
#define _IEC9_ADCAN15IE_MASK                     0x00004000
#define _IEC9_ADCAN15IE_LENGTH                   0x00000001

#define _IEC9_ADCAN16IE_POSITION                 0x0000000F
#define _IEC9_ADCAN16IE_MASK                     0x00008000
#define _IEC9_ADCAN16IE_LENGTH                   0x00000001

#define _IEC10_ADCAN17IE_POSITION                0x00000000
#define _IEC10_ADCAN17IE_MASK                    0x00000001
#define _IEC10_ADCAN17IE_LENGTH                  0x00000001

#define _IEC10_ADCAN18IE_POSITION                0x00000001
#define _IEC10_ADCAN18IE_MASK                    0x00000002
#define _IEC10_ADCAN18IE_LENGTH                  0x00000001

#define _IEC10_ADCAN19IE_POSITION                0x00000002
#define _IEC10_ADCAN19IE_MASK                    0x00000004
#define _IEC10_ADCAN19IE_LENGTH                  0x00000001

#define _IEC10_ADCAN20IE_POSITION                0x00000003
#define _IEC10_ADCAN20IE_MASK                    0x00000008
#define _IEC10_ADCAN20IE_LENGTH                  0x00000001

#define _IEC10_ADCAN21IE_POSITION                0x00000004
#define _IEC10_ADCAN21IE_MASK                    0x00000010
#define _IEC10_ADCAN21IE_LENGTH                  0x00000001

#define _IEC10_ADCAN22IE_POSITION                0x00000005
#define _IEC10_ADCAN22IE_MASK                    0x00000020
#define _IEC10_ADCAN22IE_LENGTH                  0x00000001

#define _IEC10_ADCAN23IE_POSITION                0x00000006
#define _IEC10_ADCAN23IE_MASK                    0x00000040
#define _IEC10_ADCAN23IE_LENGTH                  0x00000001

#define _IEC10_ADCAN24IE_POSITION                0x00000007
#define _IEC10_ADCAN24IE_MASK                    0x00000080
#define _IEC10_ADCAN24IE_LENGTH                  0x00000001

#define _IEC10_ADCAN25IE_POSITION                0x00000008
#define _IEC10_ADCAN25IE_MASK                    0x00000100
#define _IEC10_ADCAN25IE_LENGTH                  0x00000001

#define _IEC10_ADCAN26IE_POSITION                0x00000009
#define _IEC10_ADCAN26IE_MASK                    0x00000200
#define _IEC10_ADCAN26IE_LENGTH                  0x00000001

#define _IEC10_I2C1BCIE_POSITION                 0x0000000D
#define _IEC10_I2C1BCIE_MASK                     0x00002000
#define _IEC10_I2C1BCIE_LENGTH                   0x00000001

#define _IEC10_I2C2BCIE_POSITION                 0x0000000E
#define _IEC10_I2C2BCIE_MASK                     0x00004000
#define _IEC10_I2C2BCIE_LENGTH                   0x00000001

#define _IEC11_ADCMP1IE_POSITION                 0x00000001
#define _IEC11_ADCMP1IE_MASK                     0x00000002
#define _IEC11_ADCMP1IE_LENGTH                   0x00000001

#define _IEC11_ADCMP2IE_POSITION                 0x00000002
#define _IEC11_ADCMP2IE_MASK                     0x00000004
#define _IEC11_ADCMP2IE_LENGTH                   0x00000001

#define _IEC11_ADFLTR1IE_POSITION                0x00000003
#define _IEC11_ADFLTR1IE_MASK                    0x00000008
#define _IEC11_ADFLTR1IE_LENGTH                  0x00000001

#define _IEC11_ADFLTR2IE_POSITION                0x00000004
#define _IEC11_ADFLTR2IE_MASK                    0x00000010
#define _IEC11_ADFLTR2IE_LENGTH                  0x00000001

#define _IPC0_INT0IP_POSITION                    0x00000000
#define _IPC0_INT0IP_MASK                        0x00000007
#define _IPC0_INT0IP_LENGTH                      0x00000003

#define _IPC0_IC1IP_POSITION                     0x00000004
#define _IPC0_IC1IP_MASK                         0x00000070
#define _IPC0_IC1IP_LENGTH                       0x00000003

#define _IPC0_OC1IP_POSITION                     0x00000008
#define _IPC0_OC1IP_MASK                         0x00000700
#define _IPC0_OC1IP_LENGTH                       0x00000003

#define _IPC0_T1IP_POSITION                      0x0000000C
#define _IPC0_T1IP_MASK                          0x00007000
#define _IPC0_T1IP_LENGTH                        0x00000003

#define _IPC0_INT0IP0_POSITION                   0x00000000
#define _IPC0_INT0IP0_MASK                       0x00000001
#define _IPC0_INT0IP0_LENGTH                     0x00000001

#define _IPC0_INT0IP1_POSITION                   0x00000001
#define _IPC0_INT0IP1_MASK                       0x00000002
#define _IPC0_INT0IP1_LENGTH                     0x00000001

