Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP16GS506.h
#define _IPC38_ADCAN11IP2_POSITION               0x0000000A
#define _IPC38_ADCAN11IP2_MASK                   0x00000400
#define _IPC38_ADCAN11IP2_LENGTH                 0x00000001

#define _IPC38_ADCAN12IP0_POSITION               0x0000000C
#define _IPC38_ADCAN12IP0_MASK                   0x00001000
#define _IPC38_ADCAN12IP0_LENGTH                 0x00000001

#define _IPC38_ADCAN12IP1_POSITION               0x0000000D
#define _IPC38_ADCAN12IP1_MASK                   0x00002000
#define _IPC38_ADCAN12IP1_LENGTH                 0x00000001

#define _IPC38_ADCAN12IP2_POSITION               0x0000000E
#define _IPC38_ADCAN12IP2_MASK                   0x00004000
#define _IPC38_ADCAN12IP2_LENGTH                 0x00000001

#define _IPC39_ADCAN13IP_POSITION                0x00000000
#define _IPC39_ADCAN13IP_MASK                    0x00000007
#define _IPC39_ADCAN13IP_LENGTH                  0x00000003

#define _IPC39_ADCAN14IP_POSITION                0x00000004
#define _IPC39_ADCAN14IP_MASK                    0x00000070
#define _IPC39_ADCAN14IP_LENGTH                  0x00000003

#define _IPC39_ADCAN15IP_POSITION                0x00000008
#define _IPC39_ADCAN15IP_MASK                    0x00000700
#define _IPC39_ADCAN15IP_LENGTH                  0x00000003

#define _IPC39_ADCAN16IP_POSITION                0x0000000C
#define _IPC39_ADCAN16IP_MASK                    0x00007000
#define _IPC39_ADCAN16IP_LENGTH                  0x00000003

#define _IPC39_ADCAN13IP0_POSITION               0x00000000
#define _IPC39_ADCAN13IP0_MASK                   0x00000001
#define _IPC39_ADCAN13IP0_LENGTH                 0x00000001

#define _IPC39_ADCAN13IP1_POSITION               0x00000001
#define _IPC39_ADCAN13IP1_MASK                   0x00000002
#define _IPC39_ADCAN13IP1_LENGTH                 0x00000001

#define _IPC39_ADCAN13IP2_POSITION               0x00000002
#define _IPC39_ADCAN13IP2_MASK                   0x00000004
#define _IPC39_ADCAN13IP2_LENGTH                 0x00000001

#define _IPC39_ADCAN14IP0_POSITION               0x00000004
#define _IPC39_ADCAN14IP0_MASK                   0x00000010
#define _IPC39_ADCAN14IP0_LENGTH                 0x00000001

#define _IPC39_ADCAN14IP1_POSITION               0x00000005
#define _IPC39_ADCAN14IP1_MASK                   0x00000020
#define _IPC39_ADCAN14IP1_LENGTH                 0x00000001

#define _IPC39_ADCAN14IP2_POSITION               0x00000006
#define _IPC39_ADCAN14IP2_MASK                   0x00000040
#define _IPC39_ADCAN14IP2_LENGTH                 0x00000001

#define _IPC39_ADCAN15IP0_POSITION               0x00000008
#define _IPC39_ADCAN15IP0_MASK                   0x00000100
#define _IPC39_ADCAN15IP0_LENGTH                 0x00000001

#define _IPC39_ADCAN15IP1_POSITION               0x00000009
#define _IPC39_ADCAN15IP1_MASK                   0x00000200
#define _IPC39_ADCAN15IP1_LENGTH                 0x00000001

#define _IPC39_ADCAN15IP2_POSITION               0x0000000A
#define _IPC39_ADCAN15IP2_MASK                   0x00000400
#define _IPC39_ADCAN15IP2_LENGTH                 0x00000001

#define _IPC39_ADCAN16IP0_POSITION               0x0000000C
#define _IPC39_ADCAN16IP0_MASK                   0x00001000
#define _IPC39_ADCAN16IP0_LENGTH                 0x00000001

#define _IPC39_ADCAN16IP1_POSITION               0x0000000D
#define _IPC39_ADCAN16IP1_MASK                   0x00002000
#define _IPC39_ADCAN16IP1_LENGTH                 0x00000001

#define _IPC39_ADCAN16IP2_POSITION               0x0000000E
#define _IPC39_ADCAN16IP2_MASK                   0x00004000
#define _IPC39_ADCAN16IP2_LENGTH                 0x00000001

#define _IPC40_ADCAN17IP_POSITION                0x00000000
#define _IPC40_ADCAN17IP_MASK                    0x00000007
#define _IPC40_ADCAN17IP_LENGTH                  0x00000003

#define _IPC40_ADCAN18IP_POSITION                0x00000004
#define _IPC40_ADCAN18IP_MASK                    0x00000070
#define _IPC40_ADCAN18IP_LENGTH                  0x00000003

#define _IPC40_ADCAN19IP_POSITION                0x00000008
#define _IPC40_ADCAN19IP_MASK                    0x00000700
#define _IPC40_ADCAN19IP_LENGTH                  0x00000003

#define _IPC40_ADCAN20IP_POSITION                0x0000000C
#define _IPC40_ADCAN20IP_MASK                    0x00007000
#define _IPC40_ADCAN20IP_LENGTH                  0x00000003

#define _IPC40_ADCAN17IP0_POSITION               0x00000000
#define _IPC40_ADCAN17IP0_MASK                   0x00000001
#define _IPC40_ADCAN17IP0_LENGTH                 0x00000001

#define _IPC40_ADCAN17IP1_POSITION               0x00000001
#define _IPC40_ADCAN17IP1_MASK                   0x00000002
#define _IPC40_ADCAN17IP1_LENGTH                 0x00000001

#define _IPC40_ADCAN17IP2_POSITION               0x00000002
#define _IPC40_ADCAN17IP2_MASK                   0x00000004
#define _IPC40_ADCAN17IP2_LENGTH                 0x00000001

#define _IPC40_ADCAN18IP0_POSITION               0x00000004
#define _IPC40_ADCAN18IP0_MASK                   0x00000010
#define _IPC40_ADCAN18IP0_LENGTH                 0x00000001

#define _IPC40_ADCAN18IP1_POSITION               0x00000005
#define _IPC40_ADCAN18IP1_MASK                   0x00000020
#define _IPC40_ADCAN18IP1_LENGTH                 0x00000001

#define _IPC40_ADCAN18IP2_POSITION               0x00000006
#define _IPC40_ADCAN18IP2_MASK                   0x00000040
#define _IPC40_ADCAN18IP2_LENGTH                 0x00000001

#define _IPC40_ADCAN19IP0_POSITION               0x00000008
#define _IPC40_ADCAN19IP0_MASK                   0x00000100
#define _IPC40_ADCAN19IP0_LENGTH                 0x00000001

#define _IPC40_ADCAN19IP1_POSITION               0x00000009
#define _IPC40_ADCAN19IP1_MASK                   0x00000200
#define _IPC40_ADCAN19IP1_LENGTH                 0x00000001

#define _IPC40_ADCAN19IP2_POSITION               0x0000000A
#define _IPC40_ADCAN19IP2_MASK                   0x00000400
#define _IPC40_ADCAN19IP2_LENGTH                 0x00000001

#define _IPC40_ADCAN20IP0_POSITION               0x0000000C
#define _IPC40_ADCAN20IP0_MASK                   0x00001000
#define _IPC40_ADCAN20IP0_LENGTH                 0x00000001

#define _IPC40_ADCAN20IP1_POSITION               0x0000000D
#define _IPC40_ADCAN20IP1_MASK                   0x00002000
#define _IPC40_ADCAN20IP1_LENGTH                 0x00000001

