Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP16GS506.h
#define _IPC40_ADCAN20IP2_POSITION               0x0000000E
#define _IPC40_ADCAN20IP2_MASK                   0x00004000
#define _IPC40_ADCAN20IP2_LENGTH                 0x00000001

#define _IPC41_ADCAN21IP_POSITION                0x00000000
#define _IPC41_ADCAN21IP_MASK                    0x00000007
#define _IPC41_ADCAN21IP_LENGTH                  0x00000003

#define _IPC41_ADCAN22IP_POSITION                0x00000004
#define _IPC41_ADCAN22IP_MASK                    0x00000070
#define _IPC41_ADCAN22IP_LENGTH                  0x00000003

#define _IPC41_ADCAN23IP_POSITION                0x00000008
#define _IPC41_ADCAN23IP_MASK                    0x00000700
#define _IPC41_ADCAN23IP_LENGTH                  0x00000003

#define _IPC41_ADCAN24IP_POSITION                0x0000000C
#define _IPC41_ADCAN24IP_MASK                    0x00007000
#define _IPC41_ADCAN24IP_LENGTH                  0x00000003

#define _IPC41_ADCAN21IP0_POSITION               0x00000000
#define _IPC41_ADCAN21IP0_MASK                   0x00000001
#define _IPC41_ADCAN21IP0_LENGTH                 0x00000001

#define _IPC41_ADCAN21IP1_POSITION               0x00000001
#define _IPC41_ADCAN21IP1_MASK                   0x00000002
#define _IPC41_ADCAN21IP1_LENGTH                 0x00000001

#define _IPC41_ADCAN21IP2_POSITION               0x00000002
#define _IPC41_ADCAN21IP2_MASK                   0x00000004
#define _IPC41_ADCAN21IP2_LENGTH                 0x00000001

#define _IPC41_ADCAN22IP0_POSITION               0x00000004
#define _IPC41_ADCAN22IP0_MASK                   0x00000010
#define _IPC41_ADCAN22IP0_LENGTH                 0x00000001

#define _IPC41_ADCAN22IP1_POSITION               0x00000005
#define _IPC41_ADCAN22IP1_MASK                   0x00000020
#define _IPC41_ADCAN22IP1_LENGTH                 0x00000001

#define _IPC41_ADCAN22IP2_POSITION               0x00000006
#define _IPC41_ADCAN22IP2_MASK                   0x00000040
#define _IPC41_ADCAN22IP2_LENGTH                 0x00000001

#define _IPC41_ADCAN23IP0_POSITION               0x00000008
#define _IPC41_ADCAN23IP0_MASK                   0x00000100
#define _IPC41_ADCAN23IP0_LENGTH                 0x00000001

#define _IPC41_ADCAN23IP1_POSITION               0x00000009
#define _IPC41_ADCAN23IP1_MASK                   0x00000200
#define _IPC41_ADCAN23IP1_LENGTH                 0x00000001

#define _IPC41_ADCAN23IP2_POSITION               0x0000000A
#define _IPC41_ADCAN23IP2_MASK                   0x00000400
#define _IPC41_ADCAN23IP2_LENGTH                 0x00000001

#define _IPC41_ADCAN24IP0_POSITION               0x0000000C
#define _IPC41_ADCAN24IP0_MASK                   0x00001000
#define _IPC41_ADCAN24IP0_LENGTH                 0x00000001

#define _IPC41_ADCAN24IP1_POSITION               0x0000000D
#define _IPC41_ADCAN24IP1_MASK                   0x00002000
#define _IPC41_ADCAN24IP1_LENGTH                 0x00000001

#define _IPC41_ADCAN24IP2_POSITION               0x0000000E
#define _IPC41_ADCAN24IP2_MASK                   0x00004000
#define _IPC41_ADCAN24IP2_LENGTH                 0x00000001

#define _IPC42_ADCAN25IP_POSITION                0x00000000
#define _IPC42_ADCAN25IP_MASK                    0x00000007
#define _IPC42_ADCAN25IP_LENGTH                  0x00000003

#define _IPC42_ADCAN26IP_POSITION                0x00000004
#define _IPC42_ADCAN26IP_MASK                    0x00000070
#define _IPC42_ADCAN26IP_LENGTH                  0x00000003

#define _IPC42_ADCAN25IP0_POSITION               0x00000000
#define _IPC42_ADCAN25IP0_MASK                   0x00000001
#define _IPC42_ADCAN25IP0_LENGTH                 0x00000001

#define _IPC42_ADCAN25IP1_POSITION               0x00000001
#define _IPC42_ADCAN25IP1_MASK                   0x00000002
#define _IPC42_ADCAN25IP1_LENGTH                 0x00000001

#define _IPC42_ADCAN25IP2_POSITION               0x00000002
#define _IPC42_ADCAN25IP2_MASK                   0x00000004
#define _IPC42_ADCAN25IP2_LENGTH                 0x00000001

#define _IPC42_ADCAN26IP0_POSITION               0x00000004
#define _IPC42_ADCAN26IP0_MASK                   0x00000010
#define _IPC42_ADCAN26IP0_LENGTH                 0x00000001

#define _IPC42_ADCAN26IP1_POSITION               0x00000005
#define _IPC42_ADCAN26IP1_MASK                   0x00000020
#define _IPC42_ADCAN26IP1_LENGTH                 0x00000001

#define _IPC42_ADCAN26IP2_POSITION               0x00000006
#define _IPC42_ADCAN26IP2_MASK                   0x00000040
#define _IPC42_ADCAN26IP2_LENGTH                 0x00000001

#define _IPC43_I2C1BCIP_POSITION                 0x00000004
#define _IPC43_I2C1BCIP_MASK                     0x00000070
#define _IPC43_I2C1BCIP_LENGTH                   0x00000003

#define _IPC43_I2C2BCIP_POSITION                 0x00000008
#define _IPC43_I2C2BCIP_MASK                     0x00000700
#define _IPC43_I2C2BCIP_LENGTH                   0x00000003

#define _IPC43_I2C1BCIP0_POSITION                0x00000004
#define _IPC43_I2C1BCIP0_MASK                    0x00000010
#define _IPC43_I2C1BCIP0_LENGTH                  0x00000001

#define _IPC43_I2C1BCIP1_POSITION                0x00000005
#define _IPC43_I2C1BCIP1_MASK                    0x00000020
#define _IPC43_I2C1BCIP1_LENGTH                  0x00000001

#define _IPC43_I2C1BCIP2_POSITION                0x00000006
#define _IPC43_I2C1BCIP2_MASK                    0x00000040
#define _IPC43_I2C1BCIP2_LENGTH                  0x00000001

#define _IPC43_I2C2BCIP0_POSITION                0x00000008
#define _IPC43_I2C2BCIP0_MASK                    0x00000100
#define _IPC43_I2C2BCIP0_LENGTH                  0x00000001

#define _IPC43_I2C2BCIP1_POSITION                0x00000009
#define _IPC43_I2C2BCIP1_MASK                    0x00000200
#define _IPC43_I2C2BCIP1_LENGTH                  0x00000001

#define _IPC43_I2C2BCIP2_POSITION                0x0000000A
#define _IPC43_I2C2BCIP2_MASK                    0x00000400
#define _IPC43_I2C2BCIP2_LENGTH                  0x00000001

#define _IPC44_ADCMP1IP_POSITION                 0x00000004
#define _IPC44_ADCMP1IP_MASK                     0x00000070
#define _IPC44_ADCMP1IP_LENGTH                   0x00000003

#define _IPC44_ADCMP2IP_POSITION                 0x00000008
#define _IPC44_ADCMP2IP_MASK                     0x00000700
#define _IPC44_ADCMP2IP_LENGTH                   0x00000003

#define _IPC44_ADFLTR1IP_POSITION                0x0000000C
#define _IPC44_ADFLTR1IP_MASK                    0x00007000
#define _IPC44_ADFLTR1IP_LENGTH                  0x00000003

